Revit 2027 API
ParameterTypeId.ProfileOffsetY Property
 "Vertical Profile Offset"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ProfileOffsetY { get; }
Public Shared ReadOnly Property ProfileOffsetY As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ProfileOffsetY {
	ForgeTypeId^ get ();
}
static member ProfileOffsetY : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace